; domain
(define (domain knights-quest)
  (:requirements :strips :typing :negative-preconditions)
  (:types
    knight item location
    start_location woods_location keep_location final_location - location
  )

  (:constants
    sword map crystal_of_light - item)

  (:predicates
    (at ?k - knight ?l - location)
    (has ?k - knight ?i - item)
    (item_at ?i - item ?l - location)
    (wolves_confronted)
    (illusions_navigated)
    (sorceress_faced)
    (info_gathered)
    (spell_used)
    (passage_found)
    (minions_fought)
    (lair_searched)
  )

  (:action gather_info_from_villagers
    :parameters (?k - knight ?l - start_location)
    :precondition (and
      (at ?k ?l)
      (not (info_gathered))
    )
    :effect (and
      (info_gathered)
    )
  )

  (:action enter_woods_and_confront_wolves
    :parameters (?k - knight ?start - start_location ?woods - woods_location)
    :precondition (and
      (at ?k ?start)
      (not (wolves_confronted))
    )
    :effect (and
      (not (at ?k ?start))
      (at ?k ?woods)
      (wolves_confronted)
    )
  )

  (:action navigate_illusions_to_find_path
    :parameters (?k - knight ?l - woods_location)
    :precondition (and
      (at ?k ?l)
      (wolves_confronted)
      (not (illusions_navigated))
      (not (info_gathered))
    )
    :effect (and
      (illusions_navigated)
    )
  )

  (:action use_spell_to_dispel_illusions
    :parameters (?k - knight ?l - woods_location)
    :precondition (and
      (at ?k ?l)
      (wolves_confronted)
      (info_gathered)
      (not (illusions_navigated))
    )
    :effect (and
      (illusions_navigated)
      (spell_used)
    )
  )

  (:action discover_hidden_passage
    :parameters (?k - knight ?l - woods_location)
    :precondition (and
      (at ?k ?l)
      (illusions_navigated)
      (spell_used)
      (not (passage_found))
    )
    :effect (and
      (passage_found)
    )
  )

  (:action retreat_from_woods
    :parameters (?k - knight ?from - woods_location ?to - start_location)
    :precondition (and
      (at ?k ?from)
    )
    :effect (and
      (not (at ?k ?from))
      (at ?k ?to)
      (not (wolves_confronted))
      (not (illusions_navigated))
      (not (spell_used))
      (not (passage_found))
    )
  )

  (:action reach_keep_and_face_sorceress
    :parameters (?k - knight ?from - woods_location ?to - keep_location)
    :precondition (and
      (at ?k ?from)
      (illusions_navigated)
      (not (passage_found))
      (not (sorceress_faced))
    )
    :effect (and
      (not (at ?k ?from))
      (at ?k ?to)
      (sorceress_faced)
    )
  )

  (:action battle_sorceress_and_minions
    :parameters (?k - knight ?from - woods_location ?to - keep_location)
    :precondition (and
      (at ?k ?from)
      (passage_found)
      (not (sorceress_faced))
    )
    :effect (and
      (not (at ?k ?from))
      (at ?k ?to)
      (sorceress_faced)
      (minions_fought)
    )
  )

  (:action retrieve_crystal_and_return
    :parameters (?k - knight ?from - keep_location ?to - final_location ?c - item)
    :precondition (and
      (at ?k ?from)
      (sorceress_faced)
      (item_at ?c ?from)
    )
    :effect (and
      (not (at ?k ?from))
      (at ?k ?to)
      (has ?k ?c)
      (not (item_at ?c ?from))
    )
  )

  (:action search_lair
    :parameters (?k - knight ?l - keep_location)
    :precondition (and
      (at ?k ?l)
      (sorceress_faced)
      (not (lair_searched))
    )
    :effect (and
      (lair_searched)
    )
  )
)

; problem
(define (problem retrieve-crystal-of-light)
  (:domain knights-quest)
  (:objects
    cedric - knight
    whispering_woods_edge - start_location
    whispering_woods - woods_location
    shadowed_keep - keep_location
    eldoria_castle - final_location
  )

  (:init
    (at cedric whispering_woods_edge)
    (has cedric sword)
    (has cedric map)
    (item_at crystal_of_light shadowed_keep)
  )

  (:goal (and
      (at cedric eldoria_castle)
      (has cedric crystal_of_light)
    )
  )
)

; plan
1. (enter_woods_and_confront_wolves cedric whispering_woods_edge whispering_woods)
   deleted: (at cedric whispering_woods_edge)
   added: (at cedric whispering_woods) (wolves_confronted)
   goals met: 0 of 2
2. (navigate_illusions_to_find_path cedric whispering_woods)
   added: (illusions_navigated)
   goals met: 0 of 2
3. (reach_keep_and_face_sorceress cedric whispering_woods shadowed_keep)
   deleted: (at cedric whispering_woods)
   added: (at cedric shadowed_keep) (sorceress_faced)
   goals met: 0 of 2
4. (retrieve_crystal_and_return cedric shadowed_keep eldoria_castle crystal_of_light)
   deleted: (at cedric shadowed_keep) (item_at crystal_of_light shadowed_keep)
   added: (at cedric eldoria_castle) (has cedric crystal_of_light)
   goals met: 2 of 2
